# BGP
## Summarization

Summarization is a technique for forwarding learned networks in a summarized form.

## Topology
![Topology](https://github.com/ivandelgadilloz/BGP-notes/blob/main/assets/images/Summarization.png?raw=true)

# CLI
## BGP PE-4
```py

PE-4#show run partition router bgp 1010
!
router bgp 1010
 bgp log-neighbor-changes
 no bgp default ipv4-unicast
 neighbor 2000:100:1:1::1 remote-as 1010
 neighbor 2000:100:1:1::1 update-source Loopback0
 neighbor 2000:200:2:2::2 remote-as 1010
 neighbor 2000:200:2:2::2 update-source Loopback0
 neighbor 100.1.1.1 remote-as 1010
 neighbor 100.1.1.1 update-source Loopback0
 neighbor 200.2.2.2 remote-as 1010
 neighbor 200.2.2.2 update-source Loopback0
 !
 address-family ipv4
  network 172.16.100.0 mask 255.255.255.0
  network 172.16.101.0 mask 255.255.255.0
  network 172.16.102.0 mask 255.255.255.0
  network 172.16.103.0 mask 255.255.255.0
  neighbor 100.1.1.1 activate
  neighbor 200.2.2.2 activate
 exit-address-family
 !
 address-family ipv6
  network 2000:172:16:101::/64
  network 2000:172:16:102::/64
  network 2000:172:16:103::/64
  network 2000:172:16:104::/64
  neighbor 2000:100:1:1::1 activate
  neighbor 2000:200:2:2::2 activate
 exit-address-family


PE-4#show bgp ipv4 unicast summary | be Neig
Neighbor        V           AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
100.1.1.1       4         1010     780     779       18    0    0 11:42:10        3
```

## BGP CORE-1
```py
router bgp 1010
 bgp router-id 100.1.1.1
 bgp log-neighbor-changes
 no bgp default ipv4-unicast
 neighbor 6.6.6.6 remote-as 600
 neighbor 6.6.6.6 ttl-security hops 2
 neighbor 6.6.6.6 update-source Loopback0
 neighbor 14.14.14.14 remote-as 1010
 neighbor 14.14.14.14 update-source Loopback0
 neighbor 2000:6:6:6::6 remote-as 600
 neighbor 2000:6:6:6::6 ttl-security hops 2
 neighbor 2000:6:6:6::6 update-source Loopback0
 neighbor 2000:14:14:14::14 remote-as 1010
 neighbor 2000:14:14:14::14 update-source Loopback0
 !
 address-family ipv4
  network 100.1.1.1 mask 255.255.255.255
  neighbor 6.6.6.6 activate
  neighbor 14.14.14.14 activate
  neighbor 14.14.14.14 next-hop-self
 exit-address-family
 !
 address-family ipv6
  network 2000:100:1:1::1/128
  neighbor 2000:6:6:6::6 activate
  neighbor 2000:14:14:14::14 activate
  neighbor 2000:14:14:14::14 next-hop-self
 exit-address-family
```

## Configure summarizarition
PE-4 and CORE-1 belong to an iBGP ASN 1010, the CORE-1 router has eBGP session with PE-6. 
As PE-4 has many routes to advertise the CORE-1 router must summarize the routes learned in the iBGP and forward them to the eBGP peer with PE-6 between ASN1010 and ASN600.
```py
CORE-1#show running-config | sec bgp
router bgp 1010
 !
 address-family ipv4
  aggregate-address 172.16.100.0 255.255.252.0 summary-only
```

## Summarized networks learned by PE-6 from CORE-1
```py
PE-6#show bgp ipv4 unicast
     Network          Next Hop            Metric LocPrf Weight Path
 r>   100.1.1.1/32     100.1.1.1                0             0 1010 i
 *>   172.16.100.0/22  100.1.1.1                0             0 1010 i

#172.16.100.0/22 networks advertised from PE-4
```
```py
PE-6#show ip route bgp | be Gateway
Gateway of last resort is not set

      172.16.0.0/22 is subnetted, 1 subnets
B        172.16.100.0 [20/0] via 100.1.1.1, 11:53:31
```
## BGP PE-6
```py
PE-6#show running-config | sec bgp
router bgp 600
 bgp log-neighbor-changes
 no bgp default ipv4-unicast
 neighbor 2000:100:1:1::1 remote-as 1010
 neighbor 2000:100:1:1::1 ttl-security hops 2
 neighbor 2000:100:1:1::1 update-source Loopback0
 neighbor 100.1.1.1 remote-as 1010
 neighbor 100.1.1.1 ttl-security hops 2
 neighbor 100.1.1.1 update-source Loopback0
 !
 address-family ipv4
  network 6.6.6.6 mask 255.255.255.255
  neighbor 100.1.1.1 activate
 exit-address-family
 !
 address-family ipv6
  network 2000:6:6:6::6/128
  neighbor 2000:100:1:1::1 activate
 exit-address-family

```

bio [ivandelgadilloz](https://linktr.ee/idelgadillo)