# BGP
## Prefix List

Prefix-list is a way to filter networks that you do not want to advertise to eBGP peers, the configuration is done with a list in global configuration and is applied within the address-family of the BGP configuration.

Prefix-list allows you to define ranges of subnet mask with a minimum and a maximum.


## Topology
![Topology](https://github.com/ivandelgadilloz/BGP-notes/blob/main/assets/images/prefix-list.png?raw=true)

# CLI
## CORE-1
CORE-1 learned the pirate ASN prefix, this prefix arrives first to R2 (12.12.12.12), which sends it to CORE-1.
```py
CORE-1#show bgp ipv4 unicast | in Network|6.5.
     Network          Next Hop            Metric LocPrf Weight Path
 *>i  6.5.1.1/32       12.12.12.12              0    100      0 65110 i
 *>i  6.5.2.2/32       12.12.12.12              0    100      0 65110 i
```
PE-6 learned 6.5.1.1/32 and 6.5.2.2/32 from CORE-1 
```py
PE-6#show bgp ipv4 unicast | in Network|6.5
     Network          Next Hop            Metric LocPrf Weight Path
 *>   6.5.1.1/32       100.1.1.1                              0 1010 65110 i
 *>   6.5.2.2/32       100.1.1.1                              0 1010 65110 i
```
```py
PE-6#show ip route bgp | in 6.5.  
B        6.5.1.1 [20/0] via 100.1.1.1, 00:01:05
B        6.5.2.2 [20/0] via 100.1.1.1, 00:01:05
```


## Configuration Prefix-list on CORE-1

## CORE-1
Core-1 does not need to send all IPv4 ranges to PE-6.
The mask ranges can also be defined with the commands "ge" minimum to "le" maximum.
```py
ip prefix-list ebgp-prefix seq 5 deny 192.168.0.0/16 le 30
ip prefix-list ebgp-prefix seq 10 deny 172.16.0.0/12 ge 16 le 30
ip prefix-list ebgp-prefix seq 15 deny 10.0.0.0/8 le 30
ip prefix-list ebgp-prefix seq 20 deny 6.5.1.1/32
ip prefix-list ebgp-prefix seq 25 deny 6.5.2.2/32
ip prefix-list ebgp-prefix seq 50 permit 0.0.0.0/0 le 32
```
Apply on configuration BGP 
```py
router bgp 1010
 address-family ipv4
  neighbor 6.6.6.6 prefix-list ebgp-prefix in
  neighbor 6.6.6.6 prefix-list ebgp-prefix out
```
## Verification
Now PE-6 learned prefix 6.5.1.1/32 and 6.5.2.2/32 from other path
```py
PE-6#show bgp ipv4 unicast | in Network|6.5
     Network          Next Hop            Metric LocPrf Weight Path
 *>   6.5.1.1/32       10.67.67.7                             0 700 900 800 500 1010 65110 i
 *>   6.5.2.2/32       10.67.67.7                             0 700 900 800 500 1010 65110 i
```
```py
CORE-1#show ip prefix-list        
ip prefix-list ebgp-prefix: 6 entries
   seq 5 deny 192.168.0.0/16 le 30
   seq 10 deny 172.16.0.0/12 ge 16 le 30
   seq 15 deny 10.0.0.0/8 le 30
   seq 20 deny 6.5.1.1/32
   seq 25 deny 6.5.2.2/32
   seq 50 permit 0.0.0.0/0 le 32
```


bio [ivandelgadilloz](https://linktr.ee/idelgadillo)